       FD  SOCIOS.
       01  soc-reg.
           03 soc-codigo pic 9(4).
           03 soc-nombre pic x(20).
           03 soc-puntero pic 9(3).
